<template>
<div id="helpPage_rulesBox">
	<h1 id="helpPage_rulesTitle">Правила</h1>

	<h2>Общее</h2>
	<p class="justify">
	Ваша главная задача в игре в шляпу &ndash; это объяснение как можно большего количества слов. Традиционно в этой игре используют шляпу, куда сначала складывают слова, а потом вытаскивают для объяснения. В условиях пандемии стало сложно собираться вместе, чтобы сыграть в эту игру. Поэтому мы и сделали онлайн шляпу, чтобы вы могли играть, не выходя из дома.
	</p>

	<h2>Как начать</h2>
	<p class="justify">
	Сначала вам нужно собрать компанию. Шляпа &ndash; это игра, где вам понадобится много общаться с вашими товарищами. Вы можете использовать любые средства связи для этого, либо собраться вживую (но только если у вас уже закончился карантин ;) Выберите кодовое слово (ключ), по которому все участники смогут зайти в комнату. Также кто-то из вас может создать комнату самостоятельно и разослать всем остальным ключ или ссылку на игру. Первому из зашедших будет поручена важная роль &ndash; начать игру, когда все войдут.
	</p>

	<h2>Ход игры</h2>
	<p class="justify">
	Основную часть хода составляет этап объяснения.
	<br>
	Два игрока будут выбраны в качестве <b>текущей пары</b>, о чём все узнают заранее.
	Когда игроки будут готовы, один из них сможет увидеть <b>слово</b>, которое ему необходимо <b>объяснить</b> второму игроку в паре.
	<br>
	Если слово было объяснено успешно, нужно нажать на кнопку <b>угадал</b>. Слово будет вынуто из шляпы, а текущей паре будет засчитано объяснение слова.
	<br>
	Если во время объяснения была допущена ошибка, следует нажать на кнопку <b>ошибка</b>. В таком случае слово тоже будет вынуто из шляпы, а объяснение слов немедленно прекратится.
	<br>
	Если слово оказалось сложным, и понятно, что не получится объяснить его за оставшееся время, можно нажать на кнопку <b>сдаться</b>, чего делать мы не советуем. Хороший игрок в шляпу будет объяснять слово до победного конца.
	<br>
	Помните про <b>время</b>. Оно ограничено, и по его истечении объяснение слова должно быть прекращено. Отгадывающий при этом имеет одну попытку, чтобы угадать последнее слово.
	</p>
	<h2>Редактирование раунда</h2>
	<p class="justify">
	Когда последнее слово будет либо угадано, либо нет, объясняющему будет предоставлена возможность отредактировать прошедший раунд в случае каких-либо ошибок, допущенных во время объяснения.
	<br>
	Когда редактирование раунда завершено, начинается следующий ход.
	</p>

	<h2>Как объяснять слово</h2>
	<p class="justify">
	Вы сами можете договориться о правилах объяснения слов, например, что слово нужно объяснять жестами, но вот правила, которые мы <b>рекомендуем</b>:
	<ul>
		<li>При объяснении слова нельзя использовать однокоренные слова</li>
		<li>При объяснении нельзя использовать несуществующие слова</li>
		<li>Нельзя объяснять слово по буквам</li>
	</ul>
	<br>
	Вы можете найти более подробные правила на сайте <a href="http://thehat.ru/rules/">http://thehat.ru/rules/</a>
	</p>

	<h2>Подведение итогов</h2>
	<p class="justify">
	Когда слова закончатся, закончится и игра. Результат игрока &ndash; это <b>сумма</b> количеств объяснённых и угаданных слов.
	</p>
</div>
</template>
