<template>
  <div class="page" id="faq">
    <article class="scrollable-wrapper">
      <div class="scrollable">
        <div class="content">
          <h3 class="question">
            Мой друг создал игру, как мне к ней присоединиться?
          </h3>
          <p class="answer">
            Для этого он должен прислать вам ключ комнаты, который необходимо вставить в соответствующее поле.
          </p>

          <h3 class="question">
            Что обозначают слова, которые используются как ключи комнат?
          </h3>
          <p class="answer">
            Это не слова, а случайные последовательности букв. Нет, они не попадутся в шляпе.
          </p>

          <h3 class="question">
            Как включить голосовую связь?
          </h3>
          <p class="answer">
            Пока никак. Предполагается использование сторонних сервисов для видео и голосового общения, таких как Zoom,
            Skype или Discord.
          </p>

          <h3 class="question">
            Как поменять начальное количество слов в шляпе?
          </h3>
          <p class="answer">
            Владелец комнаты может сделать это в настройках комнаты перед началом игры.
          </p>

          <h3 class="question">
            Можно ли играть по парам?
          </h3>
          <p class="answer">
            Да, владелец комнаты может указать режим игры в настройках комнаты.
          </p>

          <h3 class="question">
            Когда заканчивается игра?
          </h3>
          <p class="answer">
            Когда все слова в шляпе будут объяснены или будет сыграно необходимое число кругов. Владелец комнаты также
            может досрочно закончить игру, нажав на кнопку с флажком.
          </p>

          <h3 class="question">
            Откуда берутся слова в шляпе?
          </h3>
          <p class="answer">
            Из словаря Sombrero API.
          </p>

          <h3 class="question">
            Я случайно закрыл вкладку с игрой, что мне делать?
          </h3>
          <p class="answer">
            Нужно зайти в комнату по её ключу под своим именем.
          </p>

          <h3 class="question">
            Мне не нравится звук. Как его отключить?
          </h3>
          <p class="answer">
            Звук можно выключить на странице игры, нажав на кнопку в правом верхем углу.
          </p>
        </div>
      </div>
    </article>
  </div>
</template>

<script>
export default {
  name: "faqPage"
};
</script>
