<template>
  <div class="page" id="news">
    <article class="scrollable-wrapper">
      <div class="scrollable">
        <div class="content">
          <!-- :date="new Date('2021-02-23')" -->
          <news-post
              :id="2"
              :date="new Date('2020-08-26')"
              version="1.2">
            <template #title>
              Новый режим, регулировка сложности и не только
            </template>
            <template #content>
              <p>
                Играть стало ещё удобнее и интереснее!
              </p>
              <ul>
                <li>Добавили режим игры со словами игроков: каждый участник пишет слова, из которых формируется набор
                  слов в шляпе
                </li>
                <li>Появились словари разных уровней сложности на русском языке</li>
                <li>Теперь вы можете загрузить собственный словарь и играть со словами из него</li>
                <li>Появилась возможность ограничить количество кругов в игре</li>
                <li>Отображение количества ходов до вашего следующего участия. Захотели налить чайку́? Теперь всё можно
                  спланировать!
                </li>
                <li>По окончании старой игры новая комната создастся автоматически. Нажмите "играть ещё раз", чтобы
                  снова сыграть всем вместе!
                </li>
              </ul>
            </template>
          </news-post>
          <news-post
              :id="1"
              :date="new Date('2020-06-25')"
              version="1.1">
            <template #title>
              Настройки в студию, вы все этого просили
            </template>
            <template #content>
              <p>
                Теперь вы не ограничены заводскими настройками. Подберите параметры под себя, чтобы играть с
                максимальным комфортом.
              </p>
              <ul>
                <li>Наконец можно выбирать время объяснения и количество слов</li>
                <li>Добавлена возможность выбора словаря: доступны словарь русских слов и словарь английских слов</li>
                <li>Строгий режим. Уже нельзя будет так просто продолжать объяснять слова, когда кончилось время</li>
                <li>Возможность выключить звук</li>
                <li>Ду ю спик инглишь? Вот и перевод подъехал</li>
                <li>Что бы ни случилось, можно закончить партию досрочно и узнать результаты</li>
              </ul>
            </template>
          </news-post>
          <news-post
              :id="0"
              :date="new Date('2020-05-24')"
              version="1.0">
            <template #title>
              Мы строили, строили и наконец достроили
            </template>
            <template #content>
              <p>
                Всеми любимая игра шляпа теперь онлайн.
              </p>
              <ul>
                <li>Доступен режим игры "каждый с каждым"</li>
                <li>Есть возможность отредактировать прошедший раунд в случае ошибки</li>
                <li>Более 10 тыс. слов в словаре</li>
              </ul>
            </template>
          </news-post>
        </div>
      </div>
    </article>
  </div>
</template>

<script>
import newsPost from "cmp/newsPost.vue";

export default {
  name: "newsPage",

  components: {newsPost}
};
</script>
